; Âûâîä "Hello world!"

        .model  tiny                        ; Ìîäåëü ïàìÿòè äëÿ COM ôàéëà. Ñåãìíåòû êîäà, äàííûõ è ñòåêà îáúåäèíåíû
        .code                               ; Íà÷àëî ñåãìåíòà êîäà
        org     100h                        ; Óñòàíàâëèâàåò ïðîãðàììíûé ñ÷åò÷èê ñî âìåùåíèåì 100h (256 áàéò)
                                            ; Ïðîãðàììà â DOS çàãðóæàåòñÿ ïîñëå ýòèõ 256 áàéò, à â ýòèõ 256 áàéò íàõîäÿòñÿ
                                            ;  ðàçëè÷íûå óïðàâëÿþùèå ñòðóêòóðû.
                                            ; Ñ ïîìîùüþ äèðåêòèâû org óñòàíàâëèâàåì ýòîò ñ÷åò÷èê, ÷òîáû ìîæíî áûëî ïîëó÷àòü ñìåùåíèÿ.
                                            ; Âñå ýòî ðàáîòàåò íà óðîâíå ñàìîãî àññåìáëåðà.     
                                            ; Ê ïðèìåðó åñëè âûñòàâèì íå 100, à 101, òî íàïå÷àòàåòñÿ "ello World!".

start:  mov     ah,9                        ; Â ðåãèñòð ah - 9, ýòî íîìåð DOS ôóíêöèè "íàïå÷àòàòü ñòðîêó".
        mov     dx,offset message           ; Â ðåãèñòð dx ïîìåùàåì ñìåùåíèå ìåòêè message ñî ñòðîêîé
        int     21h                         ; Âûçûâàåì DOS ïðåðûâàíèå 9 äëÿ âûâîäà ñòðîêè.
                                            ; Ñòðîêà âûâîäèòñÿ íà÷èíàÿ ñ àäðåñà DS:DX äî ïåðâîãî ñèìâîëà $

        ret                                 ; Êîððåêòíî çàâåðøàåì ïðîãðàììó
message db      "Hello World!",0Dh,0Ah,'$'  ; Ìåòêà ñ äàííûìè ñîîáùåíèÿ, 0Dh,0Ah - ýòî ñèìâîëû âîçâðàò êàðåòêè è ïåðåâîä ñòðîêè (\n)
        end     start                       ; Âñå ïðîãðàììû çàâåðøàþòñÿ äèðåêòèâîé end ñ óêàçàíèåì ìåòêè äëÿ ñòàðòà.