; AND
; a b = 
; 0 0 0
; 0 1 0
; 1 0 0
; 1 1 1

mov al,111
mov bl,100
and al,bl

; OR
; a b = 
; 0 0 0
; 0 1 1
; 1 0 1
; 1 1 1

mov al,111
mov bl,100
or al,bl

; XOR
; a b = 
; 0 0 0
; 0 1 1
; 1 0 1
; 1 1 0

mov al,111
mov bl,100
xor al,bl

; С NOT все понятно
               
mov al,01111110b    
; Устанавливаем по маске 1-й и последний бит в 1
or al,10000001b                     
; Сбрасываем обратно
and al,01111110b    
; Инвертируем 1-й и последний
xor al,10000001b    